Repository: g4rf/jg.gettext.js
Catalog: public_html/lang/*/LC_MESSAGES/standard.po
Languages: de_de

source: Select language:
de_de: Sprache wählen:

source: parse
de_de: Parsen

source: write JSON
de_de: Schreibe JSON

source: write POT
de_de: Schreibe POT

source: reset
de_de: Zurücksetzen

source: template
de_de: Vorlage

source: files to parse
de_de: Zu parsende Dateien

source: Select a template file, if you have any.
de_de: Wähle eine Vorlage aus, wenn Du bereits eine angelegt hast.

source: Select files for parsing.
de_de: Wähle Dateien zum Parsen aus.

source: Click 'parse'.
de_de: Klicke "Parsen".

source: Repeat last two step with all files from your project.
de_de: Wiederhole die letzten beiden Schritte für alle Dateien in deinem Projekt.

source: Export the new template with 'output JSON' or 'output POT'.
de_de: Exportiere die neue Vorlage mit "Schreibe JSON" oder "Schreibe POT".

source: Download or save the file with your browser.
de_de: Lade die Datei herunter oder speichere sie mit deinem Browser.

source: Now you're ready to edit the template (e.g. with
de_de: Nun kannst Du die Vorlage bearbeiten (z.B. mit

source: ) and use it in your project.
de_de: ) und in deinem Projekt benutzen.

source: Can't read template file.
de_de: Vorlage nicht lesbar.

source: Template file format not recognized!
de_de: Vorlagenformat nicht erkannt!

source: Template loaded.
de_de: Vorlage geladen.

source: Files selected.
de_de: Dateien ausgewählt.

source: No file selected.
de_de: Keine Datei ausgewählt.

source: parsing file
de_de: Datei parsen

source: download JSON template
de_de: lade JSON-Vorlage

source: download POT
de_de: Lade POT herunter
